# Homework: Intro to databases and sql.

For this homework I want you to explore the w3school site http://www.w3schools.com/sql/ and then implement a one table database.

#### 1 . Revise the documentation for the SQL Syntaxt we have learned today (CREATE, ALTER, INSERT, SELECT/WHERE/FROM, etc)

#### 2 . Using as a template the labs and excercises we did in class, create your own database and table with sqlite.

In [1]:
import pandas as pd
import sqlite3 as sq
import pandas as pd
import sqlite3 as sq
new_test_db = 'new_test_db.sqlite'
conn = sq.connect(new_test_db)
cur = conn.cursor()
cur.execute('CREATE TABLE relay (number INTEGER PRIMARY KEY, name TEXT, last_name TEXT, team INTEGER, position TEXT);')

#### 3 . Insert at least 5 rows.

In [2]:
relay = [
    (1, 'Asafa', 'Powell', 'Jamaika', 'first leg'),
    (2, 'Yohan', 'Blake', 'Jamaika', 'second leg'),
    (3, 'Nickel', 'Ashmeade', 'Jamaika', 'third leg'),
    (4, 'Usain', 'Bolt', 'Jamaika', 'fourth leg'),
    (5, 'Justin', 'Gatlin', 'USA', 'first leg'),
    (6, 'Tyson', 'Gay', 'USA', 'second leg'),
    (7, 'Mike', 'Rodgers', 'USA', 'third leg'),
    (8, 'Trayvon', 'Bromell', 'USA', 'fourth leg')]

cur.executemany('INSERT INTO relay VALUES (?,?,?,?,?);', relay)

conn.commit()

#### 4 . Select the rows.

In [3]:
pd.read_sql('SELECT * FROM relay;', conn)

   number     name last_name     team    position
0       1    Asafa    Powell  Jamaika   first leg
1       2    Yohan     Blake  Jamaika  second leg
2       3   Nickel  Ashmeade  Jamaika   third leg
3       4    Usain      Bolt  Jamaika  fourth leg
4       5   Justin    Gatlin      USA   first leg
5       6    Tyson       Gay      USA  second leg
6       7     Mike   Rodgers      USA   third leg
7       8  Trayvon   Bromell      USA  fourth leg

#### 5 . Delete one row and select all the rows again to show that the deletion was succesful (check the url given above for the DELETE syntax).

In [4]:
cur.execute('DELETE FROM relay WHERE number=7')
pd.read_sql('SELECT * FROM relay;', conn)

   number     name last_name     team    position
0       1    Asafa    Powell  Jamaika   first leg
1       2    Yohan     Blake  Jamaika  second leg
2       3   Nickel  Ashmeade  Jamaika   third leg
3       4    Usain      Bolt  Jamaika  fourth leg
4       5   Justin    Gatlin      USA   first leg
5       6    Tyson       Gay      USA  second leg
6       8  Trayvon   Bromell      USA  fourth leg

#### 6 . Update one row and show the results.

In [5]:
cur.execute('UPDATE relay SET position="third leg" WHERE name="Yohan"')
cur.execute('UPDATE relay SET position="second leg" WHERE name="Nickel"')
pd.read_sql('SELECT * FROM relay;', conn)

   number     name last_name     team    position
0       1    Asafa    Powell  Jamaika   first leg
1       2    Yohan     Blake  Jamaika   third leg
2       3   Nickel  Ashmeade  Jamaika  second leg
3       4    Usain      Bolt  Jamaika  fourth leg
4       5   Justin    Gatlin      USA   first leg
5       6    Tyson       Gay      USA  second leg
6       8  Trayvon   Bromell      USA  fourth leg